[
  {
    "Event": "Together with Aleksandrov, E. writes the article 'An experiment understandable to millions'",
    "Temporal": "12. Jan 29"
  },
  {
    "Event": "Writes the essay \"The principle of a cinematic art beyond the setting\".",
    "Temporal": "Feb 29"
  },
  {
    "Event": "The General Line< is taken at the extended meeting of Sovkino",
    "Temporal": "14. Feb 29"
  },
  {
    "Event": "After the end of the montage E. and Aleksandrov are asked by the General Secretary of the party Josef Stalin to redesign the final scenes of the >General Line<",
    "Temporal": "Spring 1929"
  },
  {
    "Event": "Pudovkin, Dovženko and E. celebrate the premiere of Dovženko's film 'Arsenal'",
    "Temporal": "25. Feb 29"
  },
  {
    "Event": "E. writes the essay 'Perspectives'",
    "Temporal": "04. Mar 29"
  },
  {
    "Event": "E. works on the essay 'Dramaturgy of Film- Form'",
    "Temporal": "March/April"
  },
  {
    "Event": "With Isaak Babel' E. sees the military parade in Rostov- on-Don",
    "Temporal": "01. May 29"
  },
  {
    "Event": "E. writes 'The fourth dimension of film' and draws conclusions from his lectures at the GTK in his essay 'How Pathos was made'",
    "Temporal": "Jul 29"
  },
  {
    "Event": "E., Tissé and Aleksandrov, each equipped with $25 travel money, leave Moscow; in their luggage is a copy of the >General Line",
    "Temporal": "19. Aug 29"
  },
  {
    "Event": "Arrival of the group in Warsaw",
    "Temporal": "20. Aug 29"
  },
  {
    "Event": "Arrival in Berlin. E. wants to stay in Berlin for the dubbing and premiere of the 'General Line'",
    "Temporal": "21. Aug 29"
  },
  {
    "Event": "The Society of Friends of the New Russia gives a banquet in honour of E.s. Second meeting with Käthe Kollwitz in the hotel Esplanade",
    "Temporal": "29. Aug 29"
  },
  {
    "Event": "E., Aleksandrov and Tissé travel to La Sarraz for the Congress of Independent Filmmakers.",
    "Temporal": "3-7 September 1929"
  },
  {
    "Event": "E. goes on a car trip through Switzerland with Tissé and Aleksandrov.",
    "Temporal": "07. Sep 29"
  },
  {
    "Event": "E. gives lectures in Zurich under the title 'The Russian film and my work'",
    "Temporal": "10,14,16,17 September 1929"
  },
  {
    "Event": "E. is expelled from Switzerland",
    "Temporal": "18. Sep 29"
  },
  {
    "Event": "he returns to Germany",
    "Temporal": "19. Sep 29"
  },
  {
    "Event": "E. is interviewed by Felix Mendelssohn on Berlin Radio.",
    "Temporal": "29. Sep 29"
  },
  {
    "Event": "In the Berlin Institute for Psychoanalysis E. gives a lecture on the expressiveness of the human being.",
    "Temporal": "Oct 29"
  },
  {
    "Event": "Eisenstein appeared in the Efa studio [...] to direct some recordings for the Loew film 'Toxic gas'.",
    "Temporal": "02. Oct 29"
  },
  {
    "Event": "World premiere of 'The Old and the New' (The General Line) in the Soviet Union",
    "Temporal": "07. Oct 29"
  },
  {
    "Event": "E. gives a lecture on \"Russian Film and My Work\" in the Hamburg “Schauburg am Millerntor”",
    "Temporal": "20. Oct 29"
  },
  {
    "Event": "meeting with Sternberg, Bancroft and Jannings at the Babelsberg Studios.",
    "Temporal": "15. Oct 29"
  },
  {
    "Event": "departure from Berlin to Hamburg",
    "Temporal": "18. Oct 29"
  },
  {
    "Event": "stay in Blankenese",
    "Temporal": "21-22 October 1929"
  },
  {
    "Event": "E. receives the visa for Belgium and an invitation to Holland",
    "Temporal": "26. Oct 29"
  },
  {
    "Event": "The 'General Line' is released by the German censorship with editing requirements.",
    "Temporal": "06. Nov 29"
  },
  {
    "Event": "On the 12th anniversary of the October Revolution, the uncensored 'General Line' is shown in Berlin in a closed performance.",
    "Temporal": "07. Nov 29"
  },
  {
    "Event": "Battleship Potemkin is screened in London",
    "Temporal": "10. Nov 29"
  },
  {
    "Event": "First public screening of the first two roles of the General Line in Germany",
    "Temporal": "17. Nov 29"
  },
  {
    "Event": "Meeting with George Bernard Shaw, E. later offers Arms and the Man (Heroes, 1898) for filming.",
    "Temporal": "18-19 November 1929"
  },
  {
    "Event": "E. gives the first of six lectures at the Film Society in London The main topics are: l. Screenwriting technique; 2. montage and short cut; 3. conflict and solution; 4. the three forms of expression",
    "Temporal": "19. Nov 29"
  },
  {
    "Event": "departure for Paris",
    "Temporal": "29. Nov 29"
  },
  {
    "Event": "Encounter with James Joyce",
    "Temporal": "30. Nov 29"
  },
  {
    "Event": "Return to London. During the recordings for Hans Richter's Everyday E. appears in the role of an English Bobby",
    "Temporal": "03. Dec 29"
  },
  {
    "Event": "E. gives lectures in Cambridge on general questions of film theory",
    "Temporal": "7 - 9 November 1929"
  },
  {
    "Event": "Dinner in Cambridge with the physicist J.J. Thomson and Soviet scientist Pëtr Kapicaand Montagu.",
    "Temporal": "08. Dec 29"
  },
  {
    "Event": "In London E. gives the lecture The Film Production of Soviet Russia",
    "Temporal": "13. Dec 29"
  },
  {
    "Event": "E. is in Paris and revises the article 'The fourth dimension of the film'",
    "Temporal": "20. Dec 29"
  },
  {
    "Event": "Together with Moussinac, E. of Paris to Chartres.",
    "Temporal": "29. Dec 29"
  },
  {
    "Event": "In Antwerp, at the invitation of the Society for Cultural Relations with the USSR, E. gives the lecture 'The Understanding of the Art of Film'",
    "Temporal": "30. Dec 29"
  },
  {
    "Event": "With Moussinac in Soissons.",
    "Temporal": "01. Jan 30"
  },
  {
    "Event": "Meeting with Jean Painlevé",
    "Temporal": "02. Jan 30"
  },
  {
    "Event": "An evening in honour of the Italian\nFuturist becomes E. the founder of literary futurist (?)",
    "Temporal": "08. Jan 30"
  },
  {
    "Event": "receives the visas for the Netherlands and Belgium.",
    "Temporal": "11 - 13 January 1930"
  },
  {
    "Event": "Arrival in Holland; the following day E. visits the Van Gogh Museum in Amsterdam and gives two short lectures in Rotterdam",
    "Temporal": "14. Jan 30"
  },
  {
    "Event": "stay in Saardan",
    "Temporal": "17. Jan 30"
  },
  {
    "Event": "E. gives a lecture in Amsterdam on the training course at the GIK",
    "Temporal": "18 - 19 January 1930"
  },
  {
    "Event": "On the flight from Amsterdam to Berlin stay in Hannover.",
    "Temporal": "20. Jan 30"
  },
  {
    "Event": "Arrival in Berlin",
    "Temporal": "21. Jan 30"
  },
  {
    "Event": "Together with Montagu, E. visits the Magnus Hirschfeld Institute for Sexology",
    "Temporal": "22. Jan 30"
  },
  {
    "Event": "32nd birthday E.s. Diary entry (see the pdf)",
    "Temporal": "23. Jan 30"
  },
  {
    "Event": "E. is invited by the Berlin University to give guest lectures.",
    "Temporal": "24. Jan 30"
  },
  {
    "Event": "Diary entry: 17.00 - 17.30 Einstein and\nR. Kaiser",
    "Temporal": "26. Jan 30"
  },
  {
    "Event": "arrival in Brussels.",
    "Temporal": "29. Jan 30"
  },
  {
    "Event": "Lecture on the subject of \"The Intellectual Film\".",
    "Temporal": "30. Jan 30"
  },
  {
    "Event": "gives another lecture in Seraing- La-Rouge, a suburb of Liège.",
    "Temporal": "31. Jan 30"
  },
  {
    "Event": "E. leaves Brussels for Paris",
    "Temporal": "03. Feb 30"
  },
  {
    "Event": "The >General Line< is released by the Berlin Film Testing Office without censoring",
    "Temporal": "07. Feb 30"
  },
  {
    "Event": "German premiere of the General Line in the Mozartsaal, Berlin, under the distribution title 'The battle for the earth'",
    "Temporal": "10. Feb 30"
  },
  {
    "Event": "Acquaintance in Paris with the widow of John Reed",
    "Temporal": "13. Feb 30"
  },
  {
    "Event": "With Paul Éluard and Louis Aragon, E. sees the premiere of Cocteau's play 'The Human Voice' at the Comédie Francaise",
    "Temporal": "14. Feb 30"
  },
  {
    "Event": "E. gives a lecture on intellectual film at the Sorbonne in front of 2000 people",
    "Temporal": "17. Feb 30"
  },
  {
    "Event": "Dinner with Tristan Tzara",
    "Temporal": "Feb 30"
  },
  {
    "Event": "E. visits Abel Gance during the shooting of\n>La fin du monde",
    "Temporal": "24. Feb 30"
  },
  {
    "Event": "Meeting with the architect Le Corbusier.",
    "Temporal": "28. Feb 30"
  },
  {
    "Event": "The scenario of the General Line, the first attempt in the field of cinema novella, is published in Berlin.",
    "Temporal": "Mar 30"
  },
  {
    "Event": "Joint trip with Moussinac via Soisson and Reims to Verdun",
    "Temporal": "01. Mar 30"
  },
  {
    "Event": "Return to Paris",
    "Temporal": "01. Mar 30"
  },
  {
    "Event": "Meeting with the actor Montegius \"in a tiny theater in Paris, the same Montegius to see Vladimir Iljič Lenin drove through the whole city",
    "Temporal": "05. Mar 30"
  },
  {
    "Event": "Meeting with François Hugo, the youngest son of Victor Hugo.",
    "Temporal": "06. Mar 30"
  },
  {
    "Event": "refusal by the Paris prefecture to extend E's visa.",
    "Temporal": "14. Mar 30"
  },
  {
    "Event": "E.'s hotel room is searched by the Paris police; E. himself is taken to the police station and interrogated",
    "Temporal": "21. Mar 30"
  },
  {
    "Event": "A petition against E.'s expulsion is presented to the French Prime Minister, bearing the signatures of important writers, artists, scientists, musicians and lawyers.",
    "Temporal": "25. Mar 30"
  },
  {
    "Event": "The Paris authorities extend E.'s residence permit\nuntil April 26",
    "Temporal": "01. Apr 30"
  },
  {
    "Event": "Trip with Moussinac's wife along the Riviera to Saint Maxime and Saint Tropez.\nVisit Henri Barbusse.",
    "Temporal": "19-20 March 1930"
  },
  {
    "Event": "Beginning of negotiations with Paramount's head of production, Jesse L. Lasky about an engagement to Hollywood",
    "Temporal": "21. Apr 30"
  },
  {
    "Event": "E. visits Ivette Guilbert",
    "Temporal": "28. Apr 30"
  },
  {
    "Event": "Signed an agreement with Paramount in Paris E. is assured complete freedom of choice of subject matter, direction and direction.",
    "Temporal": "Apr 30"
  },
  {
    "Event": "Receives the visa to the USA and leaves for Cherbourg the next day",
    "Temporal": "06. May 30"
  },
  {
    "Event": "On board the Europe E., Tissé and Lasky sail to New York",
    "Temporal": "08. May 30"
  },
  {
    "Event": "Arrival in New York",
    "Temporal": "12. May 30"
  },
  {
    "Event": "E. speaks at the annual congress of Paramount in Atlantic City",
    "Temporal": "14,16,17 May 1930"
  },
  {
    "Event": "Meeting with the dancer Sarah Mildred Strauss through her brother-in-law Albert Rhys Williams",
    "Temporal": "15. May 30"
  },
  {
    "Event": "The Russian-American Institute is holding a dinner in honor of E",
    "Temporal": "21. May 30"
  },
  {
    "Event": "departure for Boston.\nlives as guest of H. W. L. Dana at Longfellow House, visits Lexington, Concord and Bunker Hill",
    "Temporal": "24. May 30"
  },
  {
    "Event": "E. gives a lecture at Harvard University entitled 'Film as Art', speaks at a colloquium at Columbia University led by John Dewey. One of the audience is Jay Leyda.",
    "Temporal": "26. May 30"
  },
  {
    "Event": "Meeting with Douglas Fairbanks",
    "Temporal": "29. May 30"
  },
  {
    "Event": "Visit to the Svjatoslav Rerich Museum in New York.",
    "Temporal": "01. Jun 30"
  },
  {
    "Event": "Through Amkino* the agreement between E. and Paramount is legally signed",
    "Temporal": "05. Jun 30"
  },
  {
    "Event": "Departure to Chicago. There E. gives a lecture on assembly at the university",
    "Temporal": "05. Jun 30"
  },
  {
    "Event": "Departure from Chicago",
    "Temporal": "10. Jun 30"
  },
  {
    "Event": "Arrival in Hollywood. Meeting with Ernst Lubitsch, Maurice Chevalier and Josef von Sternber",
    "Temporal": "16. Jun 30"
  },
  {
    "Event": "First encounter with Charlie Chaplin, Jack Pickford, Marlene Dietrich and Gary Cooper, at a reception of the United Artists* arranged by Douglas Fairbanks.",
    "Temporal": "18. Jun 30"
  },
  {
    "Event": "First meeting with Upton Sinclair at a dinner.",
    "Temporal": "20. Jun 30"
  },
  {
    "Event": "E. visits Walt Disney",
    "Temporal": "18-24 June 1930"
  },
  {
    "Event": "E. renews his acquaintance with Theodor Dreiser",
    "Temporal": "24. Jun 30"
  },
  {
    "Event": "Beginning of Major Frank Pease's campaign with a telegram to Lasky",
    "Temporal": "27. Jun"
  },
  {
    "Event": "E. visits Chaplin in his house. Makes the acquaintance of Luis Buñuel and Ugarte.",
    "Temporal": "29. Jun 30"
  },
  {
    "Event": "During a visit of the representative of Amkino, Monosson, E. makes the proposal to film the \"Iron Current\" in Hollywood.",
    "Temporal": "30. Jun 30"
  },
  {
    "Event": "With Montagu and Aleksandrov, E. stays in Los Angeles for study purposes for the >Sutters Gold< project.",
    "Temporal": "08. Jul 30"
  },
  {
    "Event": "Back in Hollywood, E. designs within of three days a preliminary scenari for 'Shutter Gold'",
    "Temporal": "15. Jul"
  },
  {
    "Event": "Upton Sinclair offers E. a synopsis of his narrative\n\"Mountain City\" for filming.",
    "Temporal": "29. Jul 30"
  },
  {
    "Event": "E., Montagu and Aleksandrov are in San Francisco. They visit Sutter's Fort and talk to old settlers.",
    "Temporal": "30. Jul 30"
  },
  {
    "Event": "E. is at a party at Ernst Lubitsch's; makes acquaintance of King Vido",
    "Temporal": "02. Aug 30"
  },
  {
    "Event": "gives a lecture at the University of California\n\"The Film in Soviet Russia",
    "Temporal": "Aug 30"
  },
  {
    "Event": "Return to Hollywood. E. continues the work on 'Sutters Gold' together with Montagu and Aleksandrov",
    "Temporal": "08. Aug 30"
  },
  {
    "Event": "E. speaks at a banquet of the 'Academy of Motion Picture Arts and Sciences' in the 'Hotel Roosevelt' about theory and practice of his film work.",
    "Temporal": "21. Aug 30"
  },
  {
    "Event": "The script for\nSutters Gold is rejected by Paramount",
    "Temporal": "Sep 30"
  },
  {
    "Event": "Paramount proposes a long list of new themes to E., including An American Tragedy based on the novel by Theodore Dreiser.",
    "Temporal": "07. Sep 30"
  },
  {
    "Event": "E. gives a lecture on the wide-screen film at a discussion of the Academy of Motion Pictures Arts and Sciences: The Dynamic Square",
    "Temporal": "17. Sep 30"
  },
  {
    "Event": "E. sends the scenario of the American Tragedy to Paramount.",
    "Temporal": "05. Oct 30"
  },
  {
    "Event": "At the meeting of the 'Fish' (?) committee for the exposure of communist activities, the \"case\" E. is discussed",
    "Temporal": "07. Oct 30"
  },
  {
    "Event": "E. goes to New York",
    "Temporal": "13. Oct 30"
  },
  {
    "Event": "Arrival in New York.",
    "Temporal": "19-20 October 1930"
  },
  {
    "Event": "E. David W. Griffith meets at the \"Hotel Astor\" on Broadway",
    "Temporal": "22. Oct 30"
  },
  {
    "Event": "Paramount announces that the agreement with E. will be terminated by mutual consent by the end of the month.",
    "Temporal": "23. Oct 30"
  },
  {
    "Event": "Sinclair tells E. his disappointment at the rejection of the American Tragedy",
    "Temporal": "25. Oct 30"
  },
  {
    "Event": "The Labour Department asks E. to leave the country by the end of November. E.'s negotiations with Sinclair and Amkino. Spends the day with Robert Flaherty in Santa Monica.",
    "Temporal": "18. Nov 30"
  },
  {
    "Event": "contract - 'all footage, negative films and positive copies, as well as any story or idea in said Mexican film produced by him or under his direction in Mexico will be the property of Mary Craig Sinclair'",
    "Temporal": "24. Nov 30"
  },
  {
    "Event": "The entry visas for the film group will be issued by Sinclair",
    "Temporal": "26. Nov 30"
  },
  {
    "Event": "Hunter Kimborough goes to Mexico. Mary Craig Sinclair agrees to a treaty amendment proposed by E.",
    "Temporal": "01. Dec 30"
  },
  {
    "Event": "E., Aleksandrov and Tissé leave Hollywood.",
    "Temporal": "04. Dec 30"
  },
  {
    "Event": "E.'s team crosses the Mexican border at Nogales.",
    "Temporal": "05. Dec 30"
  },
  {
    "Event": "E arrives in Mexico City",
    "Temporal": "08. Dec 30"
  },
  {
    "Event": "Discussion with the American ambassador Clark; visit of several small theatres. discusses the formalities for filming at the Ministry of the Interior and the police headquarters;",
    "Temporal": "09. Dec 30"
  },
  {
    "Event": "E arrives in Mexico City",
    "Temporal": "08. Dec 30"
  },
  {
    "Event": "The Mexican government gives permission to film.",
    "Temporal": "11. Dec 30"
  },
  {
    "Event": "Start of shooting with shots of the fiesta in Guadelupe and bullfighting scenes.",
    "Temporal": "14. Dec 30"
  },
  {
    "Event": "E. sketches an atmospheric rough draft for the epilogue.",
    "Temporal": "17. Dec 30"
  },
  {
    "Event": "E.s team is assigned consultants for the recording work, Adolfo Best-Maugard and Augustin Aragon-Leiva.",
    "Temporal": "15. Dec 30"
  },
  {
    "Event": "E., Aleksandrov, Tissé and Kimborough are probably arrested at 10 a.m. on the basis of a denunciation by Major Pease. Released after inrerrogation",
    "Temporal": "21. Dec 30"
  },
  {
    "Event": "E. films bullfights in Puebla.",
    "Temporal": "28. Dec 30"
  }
]